jamesweidev/tennis-robot/projects/01_obstacle_avoiding_robot/firmware/STM32_ObjectAvoider/Core/V3_CollisionAvoidance/Inc/main.h

#ifndef MAIN_H_
#define MAIN_H_

#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stdlib.h>
#include <math.h>
#include "stm32f4xx_hal.h"

#define PWM_PERIOD                  2500

#define US_GPIO_PORT			    GPIOA
#define US_TRIG_PIN				    GPIO_PIN_8
#define US_ECHO_PIN 			    GPIO_PIN_9


// New motor driver pins
#define RIGHT_MOTOR_DRIVER_PORT     GPIOA
#define AIN1_PIN				    GPIO_PIN_0
#define AIN1_CHANNEL                TIM_CHANNEL_1
#define AIN2_PIN				    GPIO_PIN_1
#define AIN2_CHANNEL                TIM_CHANNEL_2

#define LEFT_MOTOR_DRIVER_PORT      GPIOB
#define BIN1_PIN				    GPIO_PIN_10
#define BIN1_CHANNEL                TIM_CHANNEL_3
#define BIN2_PIN				    GPIO_PIN_2
#define BIN2_CHANNEL                TIM_CHANNEL_4


// Encoder IC is on TIM4
#define RIGHT_ENCA_PORT             GPIOB
#define RIGHT_ENCA_PIN              GPIO_PIN_6
#define RIGHT_ENCA_CHANNEL          TIM_CHANNEL_1

#define RIGHT_ENCB_PORT             GPIOB
#define RIGHT_ENCB_PIN              GPIO_PIN_7
#define RIGHT_ENCB_CHANNEL          TIM_CHANNEL_2

#define LEFT_ENCA_PORT              GPIOB
#define LEFT_ENCA_PIN               GPIO_PIN_8
#define LEFT_ENCA_CHANNEL           TIM_CHANNEL_3

#define LEFT_ENCB_PORT              GPIOB
#define LEFT_ENCB_PIN               GPIO_PIN_9
#define LEFT_ENCB_CHANNEL           TIM_CHANNEL_4

// Drive constants
#define PRE_GEAR_TICKS              13
#define GEAR_RATIO                  20.409f
#define S_ELAPSED                   0.1f

#define WHEEL_DIAM_M                0.048f
#define WHEEL_CIRCUMFERENCE         (WHEEL_DIAM_M * M_PI)
#define TICKS_PER_ROTATION          (PRE_GEAR_TICKS * GEAR_RATIO)
#define TICKS_PER_METER             (TICKS_PER_ROTATION / WHEEL_CIRCUMFERENCE)

// Command UART6
#define UART6_GPIO_PORT             GPIOC
#define UART6_TX_PIN                GPIO_PIN_6
#define UART6_RX_PIN                GPIO_PIN_7

#define USART3_TX_PORT              GPIOC
#define USART3_TX_PIN               GPIO_PIN_10

// Directions
typedef enum
{
    ACTION_FORWARD,
    ACTION_REVERSE,
    ACTION_LEFT,
    ACTION_RIGHT,
    ACTION_STOP
} ActionType;

typedef struct {
    float prev_err;
    float i_value;
} PID_State;

typedef struct {
	volatile int32_t ticks;
	volatile int32_t prev_ticks;
	volatile float tick_rate;
	volatile float current_rpm;
    volatile int32_t target_rpm;
    int32_t final_target_rpm; // used to for smoother motor speed setting
    float starting_rpm;
    PID_State pid;
    uint32_t active_pwm_channel;
    uint32_t inactive_pwm_channel;
    
    // Debugging
    uint8_t id;
} Encoder;

typedef enum {
    STATE_IDLE,
    TURNING_TO_BALL,
    DRIVING_TO_BALL,
    OBSTACLE_DETECTED
} RobotState;

// Robot movement
void Smooth_Drive(ActionType new_action);
void Draw_Circle(float radius);
void Stop_Robot();

float Get_PID_Correction(Encoder* enc);

uint32_t Get_Turn_Ticks(float degs);

// Command Receive
void Receive_Command(void);
void Command_UART6_Init(void);
void Command_Receive_Callback(void);

// State
void Update_State(void);

// ultrasonic
float Get_Distance(void);
uint32_t micros(void);
void delay_us(uint32_t micros);

// Inits
void Ultrasonic_GPIO_Init(void);
void TIM4_IC_init(void);
void TIM3_Micros_Init(void);
void TIM2_PWM_Init(void);
void SystemClock_Config(void);

// debugging
void UART3_Init(void);
void Error_Handler(void);

#endif